
#include"ExString.h"

using namespace std;

int main()
{
	//------------------------------------------------------------------------------------
	// 初期化
	//------------------------------------------------------------------------------------
	cout << "●初期化" << endl;

	ExString str1("私の年齢は%d歳です.", 20);	    //c言語形式
	ExString str2(20);							    //int, doubleなどの数値も文字列にする
	ExString str3 = "I am " + str2 + " years old."; //string形式

	//文字列表示
	printf("%s\n", str1.c_str()); //c言語形式
	cout << str3 << endl;		  //c++形式

	cout << endl;
	//------------------------------------------------------------------------------------
	// 代入
	//------------------------------------------------------------------------------------
	cout << "●代入" << endl;

	str2 = str1;
	printf("%s\n", str2.c_str());

	string ss = "string形式の文字列を代入することも可能.";
	str2 = ss;
	cout << str2 << endl;

	str2 = "c言語形式の文字列を代入することも可能.";
	cout << str2 << endl;

	cout << endl;
	//------------------------------------------------------------------------------------
	// 文字列作成
	//------------------------------------------------------------------------------------
	cout << "●文字列作成" << endl;

	//c言語形式 : 文字列を書き換える形
	sprintf_s(str1, 1024, "%s 名前は%sです.", str1.c_str(), "山田　太郎");
	printf("%s\n", str1.c_str());

	//c++形式 : 文字列の後ろに付け加えていく形
	str3 << " My name is " << "Yamada Taro.";
	cout << str3 << endl;

	cout << endl;
	//------------------------------------------------------------------------------------
	// ExString型 → string型
	//------------------------------------------------------------------------------------
	cout << "●ExString型 → string型" << endl;

	string str = str1;
	cout << str << endl;
	str = str3;
	cout << str << endl;

	cout << endl;
	//------------------------------------------------------------------------------------
	// ExString型 → const char*型
	//------------------------------------------------------------------------------------
	cout << "●ExString型 → const char*型" << endl;

	const char* cstr = str1.c_str();
	cout << cstr << endl;
	cstr = str3.c_str();
	cout << cstr << endl;

	cout << endl;
	//------------------------------------------------------------------------------------
	// ユーザ入力
	//------------------------------------------------------------------------------------
	cout << "●ユーザ入力" << endl;

	cout << "感想をどうぞ！" << endl;
	cin  >> str1;
	cout << "あなたの感想：" << str1;

	cout << endl;
}
